//******************************************************************************
//
//
//      audio
//
//
//******************************************************************************

//------< インクルード >---------------------------------------------------------
#include "all.h"

//------< namespace >-----------------------------------------------------------
using namespace GameLib;

//--------------------------------
//  初期設定
//--------------------------------
void audio_init()
{
	music::load(0, L"./Data/Musics/bgm1.wav", 0.3f);
	//music::load(1, L"./Data/Musics/bad.wav", 0.3);
	sound::load(L"./Data/Sounds/sound.xwb");



	//効果音の読み込み
	//sound::load(L"./Data/Sounds/Shooting.xmb");

}

//--------------------------------
//  終了処理
//--------------------------------
void audio_uninit()
{
    // 音楽の解放処理
    int i;
    for (i = 0; i < MUSIC_FILE_MAX; i++)
        music::unload(i);
}
