#ifndef INCLUDED_CHECK
#define INCLUDED_CHECK

//******************************************************************************
//
//
//      check.h
//
//
//******************************************************************************

//------< 定数 >----------------------------------------------------------------


//------< プロトタイプ宣言 >-----------------------------------------------------
int  check_conncet();
void check(int returnStage,int nextStage);
void check_enemy_guard(int returnStage);

#endif // !INCLUDED_CHECK