#ifndef INCLUDED_ENDING
#define INCLUDED_ENDING

//******************************************************************************
//
//
//      ending.h
//
//
//******************************************************************************

//------< 定数 >----------------------------------------------------------------

//------< プロトタイプ宣言 >-----------------------------------------------------
void game_over_draw();
void game_good_end_draw(int ending_timer);
void game_bad_end_draw(int ending_timer);

#endif // !INCLUDED_ENDING