#ifndef INCLUDED_ENEMY
#define INCLUDED_ENEMY

//******************************************************************************
//
//
//      enemy.h
//
//
//******************************************************************************

//------< 定数 >----------------------------------------------------------------

//------< プロトタイプ宣言 >-----------------------------------------------------
void enemy_init();
void enemy_update();
void enemy_draw();
void enemy_0_move(int leftLimit,int rightLimit);


#endif // !INCLUDED_ENEMY