#ifndef INCLUDED_STAGE
#define INCLUDED_STAGE

//******************************************************************************
//
//
//      stage.h
//
//
//******************************************************************************

//------< 定数 >----------------------------------------------------------------

//------< プロトタイプ宣言 >-----------------------------------------------------
void stage_1_init();
void stage_1_update();
void stage_2_init();
void stage_2_update();
void stage_3_init();
void stage_3_update();


#endif // !INCLUDED_STAGE